[
    "trade idea long atom/usd\n\nwith atom consolidating below ath and sol and avax and other layer 1s making all time highs i think its probably a somewhat safe bet to think atom will too so we will long atom here in anticipation of another layer 1 season.\n\nentry now 38.79\nStop 35.42\ntarget 50\n\n3.81RR 31.8%\n\n@everyone",
    "trade idea long crv/usd\n\ndeleting old crv order and going to chase crv here and long @ market after it missed our limit buy buy 3c <:Cry:749744961469284402> \n\nentry now 4.279\nStop 3.453\nTarget $7.9\n\n4.39RR 85%\n\n@everyone",
    "Trade Idea: Polis/USD (buy) \n\nLonging some Polis here for a swing.\nIt's a gaming coin on Sol. \nOn daily its had a clean ABC from the highs, a 3 day engulfing and a weekly sfp so buying some with 2 targets. 2/3s will be taken at the first tp if it hits with the rest left to run to tp2.\n\nEntry: 7.91 (now)\nStop: 5.749\nTP1: 14.498\nTP2: 22.88\n\nRR - 3 & 6.9\n\n\n@everyone",
    "trade idea relong sol/usd\n\ngoing to relong the position on sol we closed off yesterday, price action looking good again and we can probs now have an even tighter stop loss\n\nentry now 204.64\nStop 184.48\ntarget 280\n\n37% 3.88RR\n\n@everyone",
    "trade idea long crv/usd ( lower)\n\ngoing to set a buy limit at $4 on crv to scoop up any capitualtion under last weeks $4.06 lows, target will be around $8 or so as we have a confirmed breakout on the weekly timeframe\n\nentry (lower) $4\nstop 3.44\ntarget $8\n\n100% 7.1RR\n\n@everyone",
    "trade idea long alice/usd\n\ngoing to long some alice here also has a nice narrative and seems like a lagger for now\n\nEtnry now 15.587\nStop 12.4\nTarget 23.8\n\n52% 2.55RR\n\n@everyone",
    "trade idea long CHZ/USD\n\ngoing to long some CHZ as a metaverse play on the back of zuckerbergs new meta company\n\ntrying to be left bell curve and jumping on the hype and choosing chz as it hasnt run as much as some others like enj and mana etc yet and also it is on ftx so easily accessible to all.\n\nentry now 0.344\nstop 0.27\ntarget 0.57\n\n3.23RR 67%\n\n@everyone",
    "Trade Idea: COPE/USD (buy)\n\nBought some Cope here. See <#606950822013566977> for reasoning but it's had an impulse move from the low and has been contracting nicely with an IHS and looks like it'll break out soon. \n\nPlease note there is only spot markets for this and liquidity isn't great so please take into consideration if following. It is also trading on Raydium as well which might be better for bigger size. https://dex.raydium.io/#/market/\n\n\nEntry: 2.20 (now) \n\nStop: 1.069\n\nTP: 5.78\n\nRR - 3.17\n\n\n@everyone",
    "trade idea long doge/usd\n\ni actually do think doge looks really nice here for a majnor move up considering current market dynamics and also intraday breakout\n\ngoing to long some doge here to the major 0.618 at around 50c however stop must be fairly wide at 24% so position size accordingly\n\nentry now 0.2901\nStop 0.218\ntarget 0.51c\n\n78% 3.17RR\n\n@everyone",
    "trade idea re-long eth/usd\n\ngoing to long eth here after it swept the lows of the A wave weve been talking about and i believe that may have been the low and it missed our lower bid by 0.28%\n\ngoing to delete the lower order and long eth now with same stop and target.\n\nentry now: 3943.3\nstop 3620\ntarget 4605\n\n17% 2.14RR\n\n@everyone",
    "Trade Idea: SNX/USD - buy\n\nLonging some snx here. Think this is a dip to buy now that it's taken the lows of the range and with its BTC pair at a key level looking good on higher tf's I think the risk reward is worth it here \n\n\nEntry: 9.45 (now)\nStop: 8.698\n\nTP: 13.48\n\nRR - 5.3\n\n@everyone",
    "trade idea long sol/usd\n\n\nbased on the sol/btc hourly which weve been tracking i think the low is in for sol and a leg up to ath can now start, going to long some sol here with stop below that wick with target around 280 or so\n\nentry now 189.83\nStop 173.61\ntarget 278.88\n\n47% 5.68RR\n\n@everyone",
    "",
    "trade idea re-long eth/usd (lower)\n\ngoing to relong the eth that we closed earlier today around 3876 after it sweeps the 4h lows with target at all time high\n\nentry (lower) 3876.4\nstop 3620\ntarget 4605\n\n18.8% 2.85RR\n\n@everyone",
    "Trade Idea : Aave/usd Buy (some lower) \n\nWe longed some aave here and have some bids set lower. On higher timeframes against btc it has an impulse on weekly with the correction looking close enough to complete  and against usd looks to be basing so feel the risk reward is worth it here. \n\nplease note we do have a bit open so keep in mind of risk management if following. \n\nEntry: 314.6(now)\nEntry 2: 293.6 (lower)\nStop: 249.8\n\nTP: 472.4\n\nRR  - 2.4 & 4\n\n@everyone"
]