[
    "Trade Idea: Atom/USD - buy\n\nBuying some Atom here. See <#584153793227390998> for reasoning. 2/3s will be taken off at tp1 if it hits with the remainder left to run to tp2. \n\nEntry: 29.30 (now) \nStop: 24.48\nTP1 : 42.88\nTP2: 53.88\n\n\nRR - 2.8 & 5.1\n\n@everyone",
    "trade idea - buy CRV \n\nWe're getting long some CRV here due to the nice 4h shaping up. Placing stops below wick lows.\n\nEntry - 3.695 (now)\nStop - 3.222 (12.48%)\nTP - 4.815 (30.3%)\nRR - 2.43\n\n@everyone",
    "trade idea long luna/usd\n\ngoing to long some luna here, wanting some more layer 1 exposure but i think at the moment luna looks a bit more bullish then sol so will look to scoop up some luna exposure here targeting new ath as a nice clean abc looks complete now\n\nentry now 43.522\nstop 38.316\ntarget 60\n\n38% 3.23RR\n\n@everyone",
    "Trade Idea: BTC/USD (buy) \n\nBuying some BTC here. It's at the bottom of the daily range and the 4 hr has formed an sfp so the risk reward looks worth it here and tp is at new highs in line btc updates\n\nEntry: 60650 (now) \nStop: 58488\nTP: 74888\n\nRR - 6.5\n\n@everyone",
    "trade idea long bnb/usd\n\nbuying some bnb here as its perfectly on the 0.618 after what looks like a nice leading diagonal, i think we can have a tighter stop on this one than on our other 2 core eth and btc longs\n\nentry now 605.76\nstop 582.468\ntarget 745.63\n\n23.3% 6.22RR\n\n@everyone",
    "trade idea long btc/usd\n\nbtc has hit the support level i was looking to bid, it may come a tad lower but all in all i think this is still a good entry point targettign new ATH\n\nentry now 61281\nstop 59232\ntarget 74856\n\n22.26% 6.84RR\n\n@everyone",
    "trade idea long eth/usd\n\nrelonging eth here, eth btc looks like a nice clean abc on 4h and btc hit the retrace level that i was looking for so i think we can start to scale back into some things now we are showing signs of support\n\nentry now 4352.79\nStop 3874\nTarget 5992\n\n37.8% 3.46RR\n\n@everyone",
    "trade idea short avax/usd\n\nshorting avax here as it has done a clear 5 waves up on 4h, also formed a bearish 4h sfp and the btc pair also lines up perfectly with the usd pair so i think avax has a strong chance of falling more than btc or eth.\n\n going with 2 targets on the way down. this is a fairly high conviction trade for me\n\nentry now: 94.713\nstop 102.619\ntarget1: 82.733 ( 12.65% 1.56RR)\ntarget2: 72.43 (23.53% 2.82RR)\n\n@everyone",
    "trade idea long avax/usd\n\ngoing to long avax here and remove the lower order as the abc looks done now and rr is still favourable at 2.26RR\n\nentry now 85.931\nstop 78.255\ntarget 103.2\n\n20.22% 2.26RR\n\n@everyone",
    "trade idea long eth/usd\n\nnow the dust has settled and we have a nice clean 5 wave rise from the lows on hourly after the flash crash yesterday i think we will be relonging eth here targetting a new high.\n\nentry now 4724.6\nstop 4453\ntarget 5500\n\n16.5% 2.9RR\n\n@everyone",
    "trade idea long avax/usd (lower)\n\ngoing to set an order to buy avax at the 50 fib in the hopes of a c wave pullback as outlined in <#819494299971878932>  video update\n\nentry (lower) 84.15\nstop 78.255\ntarget 103\n\n22.7% 3.25RR\n\n@everyone",
    "Trade Idea: TLM/USD (buy)\n\nLonging some tlm here. See the video in <#606950822013566977> for reasoning \n\nEntry: 25.1 cents (now) \n\nStop: 21.9 cents\n\nTP : 35.9 cents\n\n\nRR - 3.37\n\n@everyone",
    "trade idea long bnb/usd\n\ngoing to dip my toes back in bnb here too, it was one of the strongest on the way up and our trailed up stop got hit during that bloodbath a few hours ago\n\nentry now 619.56\nStop 574.79\ntarget 736\n\n2.67RR 19%\n\n@everyone",
    "trade idea long btc/usd\n\nmight start dipping my toes back in the water after we got that crazy marketwide nuke out of the way.\n\nas always ill start with btc only for now as it is the safest \n\nentry now 65094\nStop 62565\ntarget 75k\n\n3.87RR 15.5%\n\n@everyone",
    "trade idea relonging avax/usd\n\ni think we got stop hunted on avax and still looks like a nice clean abc, going to relong here with same target as yesterday.\n\nentry 74.61\nstop 72\ntarget 94.9\n\n27.3% 7.9RR\n\n@everyone"
]